Revit 2027 API
SiteLocation.GeoCoordinateSystemDefinition Property
 The XML or WKT2 string which describes the geographic coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GeoCoordinateSystemDefinition { get; }
Public ReadOnly Property GeoCoordinateSystemDefinition As String
	Get
public:
property String^ GeoCoordinateSystemDefinition {
	String^ get ();
}
member GeoCoordinateSystemDefinition : string with get
Property Value
String
Remarks
 If the site does not have a geographic coordinate system, it returns an empty string for this property.
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace